app/views/users/_form.html.erb

  <div class="group">
    <%= f.label :first_name, t("activerecord.attributes.user.first_name", :default => "First name"), :class => :label %>
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 5) LIMIT 1