app/views/softwares/_form.html.erb

    <%= f.label :operating_system_id,  t("activerecord.attributes.software.operating_system_id", :default => "Operating System"), :class => :label %>
	<%= f.collection_select(:operating_system_id, OperatingSystem.all, :id, :name, {:prompt => true}) %>
---
SELECT "operating_systems".* FROM "operating_systems" ORDER BY name