app/views/items/_form.html.erb

SELECT "operating_systems".* FROM "operating_systems" ORDER BY number
---
    <%= f.label :operating_system_id,  t("activerecord.attributes.item.operating_system_id", :default => "Operating System"), :class => :label %>
	<%= f.collection_select(:operating_system_id, OperatingSystem.all, :id, :name, {:prompt => true}) %>