app/views/items/_items.html.erb

SELECT "items".* FROM "items" WHERE (inventoried_at > '2009-12-22 16:54:42')
---
			<td><%= h item.make_and_model %></td>
			<td><%= h item.short_type unless item.type_of_item.blank? %></td>