app/views/items/_sidebar.html.erb

		<% ["Desktop", "Laptop", "Server", "Printer", "Virtual Machine", "Other"].each do |item_type| %>
	    <li><%= link_to item_type +" - " + Item.by_type(item_type).count.to_s, :controller=>"items", :action=>:index, :type=>item_type %></li>
---
SELECT "items".* FROM "items" ORDER BY name, type_of_item
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "items" WHERE (name LIKE '%test%' OR vt_tag like '%test%' or model like '%test%' or serial like '%test%')) AS subquery

		<li><%= link_to "Not Inventoried Recently-  #{Item.not_inventoried_recently.count.to_s}", :controller=>"items", :action=>:not_checked %></li>
		<li><%= link_to "No Priority-  #{Item.no_priority.count.to_s}", :controller=>"items", :action=>:index, :no_priority=>true %></li>
---
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "items" WHERE ("items"."priority" IS NULL)) AS subquery