app/views/items/index.html.erb

SELECT "items".* FROM "items" ORDER BY name, location.building_id
---
			<td><%= h item.make_and_model %></td>
			<td><%= h item.short_type unless item.type_of_item.blank? %></td>