app/views/items/show.html.erb

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
		 <b><%= t("activerecord.attributes.item.user_id", :default => t("activerecord.labels.user_id", :default => "User/Responsible Person")) %>:</b>
          <%= @item.user.full_name unless @item.user.blank? %>