app/controllers/announcements_controller.rb

  def index
    @announcements = Announcement.all
---
SELECT * FROM "announcements" LIMIT 1

  def show
    @announcement = Announcement.find(params[:id])
---
SELECT * FROM "announcements" WHERE ("announcements"."id" = 298486374)

  def edit
    @announcement = Announcement.find(params[:id])
---
SELECT * FROM "announcements" WHERE ("announcements"."id" = 298486374)

  def destroy
    @announcement = Announcement.find(params[:id])
    @announcement.destroy
---
SELECT * FROM "announcements" WHERE ("announcements"."id" = 298486374)
DELETE FROM "announcements" WHERE "id" = 298486374