app/controllers/buildings_controller.rb

  def show
    @building = Building.find(params[:id])
---
SELECT "buildings".* FROM "buildings" WHERE ("buildings"."id" = 2) LIMIT 1

  def edit
    @building = Building.find(params[:id])
---
SELECT "buildings".* FROM "buildings" WHERE ("buildings"."id" = 2) LIMIT 1

  def destroy
    @building = Building.find(params[:id])
    @building.destroy
---
SELECT * FROM "buildings" WHERE ("buildings"."id" = 298486374)
DELETE FROM "buildings" WHERE "id" = 298486374