app/controllers/dns_names_controller.rb

  def index
    @dns_names = DnsName.all
---
SELECT "dns_names".* FROM "dns_names"

  def show
    @dns_name = DnsName.find(params[:id])
---
SELECT * FROM "dns_names" WHERE ("dns_names"."id" = 298486374)

  def edit
    @dns_name = DnsName.find(params[:id])
---
SELECT * FROM "dns_names" WHERE ("dns_names"."id" = 298486374)

  def destroy
    @dns_name = DnsName.find(params[:id])
    @dns_name.destroy
---
SELECT * FROM "dns_names" WHERE ("dns_names"."id" = 298486374)
DELETE FROM "dns_names" WHERE "id" = 298486374