app/controllers/installations_controller.rb

SELECT "softwares".* FROM "softwares" WHERE ("softwares"."id" = 1) ORDER BY name LIMIT 1
SELECT "items".* FROM "items" WHERE ("items"."id" = 7) LIMIT 1
INSERT INTO "installations" ("created_at", "item_id", "software_id", "updated_at") VALUES ('2011-03-30 13:44:37.699621', 7, 1, '2011-03-30 13:44:37.699621')
---
  def install_software
      if params[:software_selection].blank?
        flash[:notice] = "You must select the software to install"
        redirect_to :back
      elsif params[:item].blank?
        flash[:notice] = "You must choose the item that the software will be installed on."
        redirect_to :back
      end
      begin
        @installation = Installation.new
        @installation.software = Software.find(params[:software_selection])
        @installation.item = Item.find(params[:item])
        if @installation.save