app/controllers/items_controller.rb

  def show
    @item = Item.find_by_name(params[:id])
---
SELECT "dns_names".* FROM "dns_names" WHERE ("dns_names".item_id = 1)

  def update
    @item = Item.find_by_name(params[:id])
---
SELECT "items"."id" FROM "items" WHERE ("items"."name" = 'barcode') AND ("items".id <> 8) LIMIT 1