app/controllers/items_controller.rb

SELECT "items".* FROM "items" ORDER BY name, location.building_id
SELECT "items".* FROM "items" WHERE ("items"."in_use" = 't') ORDER BY name asc
SELECT "items".* FROM "items" WHERE (name LIKE '%test%' OR vt_tag like '%test%' or model like '%test%' or serial like '%test%') ORDER BY name desc LIMIT 20 OFFSET 0
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "items" WHERE (name LIKE '%test%' OR vt_tag like '%test%' or model like '%test%' or serial like '%test%')) AS subquery
---
  def index
    if params[:in_use]=="false"
      if params[:no_priority]=="true"
        @items = Item.search(params[:search]).order(sort_column + " " +sort_direction).no_priority
      else
        @items = Item.search(params[:search]).order(sort_column + " " +sort_direction)
      end
    else
      if params[:no_priority]=="true"
        @items = Item.search(params[:search]).in_use.order(sort_column + " " +sort_direction).no_priority
      else
        @items = Item.search(params[:search]).in_use.order(sort_column + " " +sort_direction)
      end

    end
      @title = "Items"
    respond_to do |format|
      format.html {@items = @items.paginate(:per_page=>20, :page=>params[:page]) }

SELECT "items".* FROM "items" WHERE (inventoried_at < '2009-12-22 16:56:21' OR inventoried_at IS NULL) LIMIT 100 OFFSET 0
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "items" WHERE (inventoried_at < '2009-12-22 16:57:56' OR inventoried_at IS NULL)) AS subquery
---
  def not_checked
    @items = Item.not_inventoried_recently.paginate(:per_page=>100, :page=>params[:page])

SELECT "items".* FROM "items" WHERE ("items"."id" = 1) ORDER BY name LIMIT 1
---
  def show
    @item = Item.find(params[:id])

INSERT INTO "items" ("created_at", "hard_drive", "in_use", "info", "inventoried_at", "location_id", "make", "model", "name", "operating_system_id", "os", "processor", "processor_rating", "purchased_at", "ram", "recieved_at", "serial", "surplused_at", "type_of_item", "updated_at", "user_id", "vt_tag", "warranty_expires_at") VALUES ('2010-11-19 21:05:34.869228', NULL, 't', ': Something', NULL, NULL, NULL, NULL, 'Something', NULL, NULL, NULL, NULL, '2010-11-19 21:05:00.000000', NULL, '2010-11-19 21:05:00.000000', NULL, NULL, 'Laptop', '2010-11-19 21:05:34.869228', NULL, NULL, '2010-11-19 21:05:00.000000')
---
  def create
    @item = Item.new(params[:item])
    if @item.save

SELECT "items".* FROM "items" WHERE ("items"."id" = 8) ORDER BY name LIMIT 1
---
  def edit
    @item = Item.find(params[:id])

SELECT "items".* FROM "items" WHERE ("items"."id" = 8) ORDER BY name LIMIT 1
UPDATE "items" SET "critical" = 't', "location_id" = 2, "surplused_at" = '2011-01-10 19:44:00.000000', "updated_at" = '2011-03-01 13:48:43.781371' WHERE ("items"."id" = 7)
---
  def update
    @item = Item.find(params[:id])
    if @item.update_attributes(params[:item])

SELECT * FROM "items" WHERE ("items"."id" = 298486374) ORDER BY name
DELETE FROM "items" WHERE "id" = 298486374
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy

SELECT "items".* FROM "items" WHERE ("items"."id" = 1) LIMIT 1
---
  def add_ip
    @item = Item.find(params[:item])

DELETE FROM "dns_names" WHERE ("dns_names"."id" = 11)
SELECT "dns_names".* FROM "dns_names" WHERE ("dns_names"."id" = 11) LIMIT 1
---
  def remove_dns_name
    @dns = DnsName.find(params[:name]).destroy

SELECT "items".* FROM "items" WHERE ("items"."id" = 7) LIMIT 1
---
  def surplus
    @item = Item.find(params[:id])