app/controllers/locations_controller.rb

  def create
    @location = Location.new(params[:location])
    if @location.save
---
INSERT INTO "locations" ("building_id", "created_at", "info", "name", "updated_at") VALUES (2, '2011-03-01 13:44:48.640114', '', '211', '2011-03-01 13:44:48.640114')

  def destroy
    @location = Location.find(params[:id])
    @location.destroy
---
DELETE FROM "locations" WHERE "id" = 298486374