app/controllers/operating_systems_controller.rb

  def index
    @operating_systems = OperatingSystem.all
---
SELECT "operating_systems".* FROM "operating_systems" ORDER BY name

  def show
    @operating_system = OperatingSystem.find(params[:id])
---
SELECT "operating_systems".* FROM "operating_systems" WHERE ("operating_systems"."id" = 2) ORDER BY name LIMIT 1

  def create
    @operating_system = OperatingSystem.new(params[:operating_system])
    if @operating_system.save
---
INSERT INTO "operating_systems" ("created_at", "info", "name", "updated_at") VALUES ('2011-01-03 20:06:37.111147', '', 'BlueOS', '2011-01-03 20:06:37.111147')

  def edit
    @operating_system = OperatingSystem.find(params[:id])
---
SELECT * FROM "operating_systems" WHERE ("operating_systems"."id" = 298486374)

  def destroy
    @operating_system = OperatingSystem.find(params[:id])
    @operating_system.destroy
---
SELECT * FROM "operating_systems" WHERE ("operating_systems"."id" = 298486374)
DELETE FROM "operating_systems" WHERE "id" = 298486374