app/controllers/softwares_controller.rb

SELECT "softwares".* FROM "softwares" ORDER BY name
---
  def index
    @softwares = Software.all

SELECT "softwares".* FROM "softwares" WHERE ("softwares"."id" = 2) ORDER BY name LIMIT 1
---
  def show
    @software = Software.find(params[:id])

SELECT "softwares".* FROM "softwares" WHERE ("softwares"."id" = 2) ORDER BY name LIMIT 1
---
  def edit
    @software = Software.find(params[:id])

SELECT "softwares".* FROM "softwares" WHERE ("softwares"."id" = 2) ORDER BY name LIMIT 1
DELETE FROM "softwares" WHERE ("softwares"."id" = 2)
---
  def destroy
    @software = Software.find(params[:id])
    @software.destroy