app/controllers/users_controller.rb

  def index
    @users = User.order "last_name"
---
SELECT "users".* FROM "users" ORDER BY last_name

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 5) LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1
UPDATE "users" SET "last_login" = '2011-11-06 18:40:37.903590', "updated_at" = '2011-11-06 18:40:37.905879' WHERE ("users"."id" = 1)