app/views/reports/_items.html.erb

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
	<td><%= item.make_and_model %></td>
	<td><%= item.user.full_name unless item.user.blank? %></td>