app/views/locations/_form.html.erb

    <%= f.label :building_id,  t("activerecord.attributes.location.building_id", :default => "Building"), :class => :label %>
	<%= f.collection_select(:building_id, Building.all, :id, :name, {:prompt => true}) %>
---
SELECT "buildings".* FROM "buildings"