app/views/ips/_form.html.erb

SELECT "buildings".* FROM "buildings"
---
    <%= f.label :building_id,  t("activerecord.attributes.ip.building_id", :default => "Building"), :class => :label %>
	<%= f.collection_select(:building_id, Building.all, :id, :name, {:prompt => true}) %>